---
title: ViewSheetSet
classe: Autodesk.Revit.DB.ViewSheetSet
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ViewSheetSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsAutomatic { get; set; }` | `viewSheetSet.IsAutomatic` | Boolean |
| `String Name { get; set; }` | `viewSheetSet.Name` | String |
| `IReadOnlyList<View> OrderedViewList { get; set; }` | `viewSheetSet.OrderedViewList` | IReadOnlyList<View> |
| `ElementId SheetOrganizationId { get; set; }` | `viewSheetSet.SheetOrganizationId` | ElementId |
| `ElementId ViewOrganizationId { get; set; }` | `viewSheetSet.ViewOrganizationId` | ElementId |
| `ViewSet Views { get; set; }` | `viewSheetSet.Views` | ViewSet |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```